// Написать программу на языке С#, в которую пользователь вводит два целых числа и получает частное введенных чисел
Console.WriteLine("Введите два числа. Выведена частное введенных чисел");
double numberA = 20;
double numberB = 5;
Console.WriteLine(numberA / numberB);