// Написать программу сложени двух чисел
Console.WriteLine("Введите первое и второе слагаемое. Выведена их сумма");
int numberA = 6;
int numberB = 8;
// Второй вариант. Можно int result = (numberA + numberB);
// Console.WriteLine(result); 
Console.WriteLine(numberA + numberB);